{
  "matches": [
    {
      "id": "b8e01d70-629e-4bb9-95cf-a2a0c9b139ca",
      "score": 0.88221848,
      "values": [],
      "metadata": {
        "content": "your cofounder? Tell me about the team? How did you find your first hires? What is the specific problem you are solving? What’s the key insight about your user that led you to build this business? What’s the ideal outcome for your customer? How are customers currently solving this problem, before your product/solution existed? What differentiates your solution from alternatives? What have your biggest learnings been so far? How are you planning to acquire customers? What would your customers say about your solution, and how would they react if it went away (i.e. you went out of business)? Why now? What has changed in technology or the market that makes this possible only now? What do you think has to go right for this to be a massive outcome? How much do you want to raise, and what milestones do you hit with that capital? VC Pitch Deck FAQ Because Google says people are asking questions. What is a VC pitch deck? A VC pitch deck is a presentation (typically in Powerpoint, Google Sheets or PDF) used to explain a startup idea to potential venture capital investors. A pitch deck contains information on the business, the market and the company’s traction/financials. What is a pitch deck used for? These presentations are used to 1) convince venture capitalists to take a 1st meeting with the founder(s); 2) begin investment due diligence and 3) convince the venture firm’s partnership to want to invest in a startup. Will a deck help you get a meeting with a VC? A great venture capital pitch deck may help you get a meeting with a venture capitalist. VC firm NFX reminds startup founders that investors are looking for the following 12 data points before taking a meeting with a startup: Team Company description Market opportunity Business model (how you make $ + your financial projections) Geography (less important post COVID) Team size (FTEs) Timing of the fundraise Company traction How much you are raising Fundraising history Fit for the specific VC Referrer - who introduced you to the fund Does your venture capital presentation have to be PowerPoint? VCs typically expect a slide deck; these days usually a PowerPoint, Google Slides or a PDF of one of those formats. I’ve been with companies that have used designers to create an incredibly slick venture capital presentation, which they presented as a PDF - no idea which tool was used to actually design the presentation, but it was likely an Adobe product. The most important thing is making the presentation be in 1) slides and 2) something they can share and access from their computer. Is it OK to share your venture capital presentation by DocSend or a presentation sharing platform instead of as an email attachment? These days more and more VCs are Ok getting the presentation as a DocSend or other presentation sharing platform that asks for their email address or asks to verify that they are someone you to share the document with. However, you’ll occasionally find the grump VC who wants their presentation the old school way. Often these investors write up their dislike of sharing tools on their blog or Twitter. How do you modify your pitch deck for the final, all-hands VC partner pitch? The final step to getting a term sheet, at many venture capital firms, is to pitch the partnership one final time. This is after you’ve already gotten one of the partners to support your investment internally as the champion. In the final meeting, you’ll have the full range of understanding of your company - from the partner who is supporting you and who knows a ton to partners who know close to nothing. It’s not safe to assume knowledge on your industry or problem. Invite all the partners into the fold by explaining and building excitement around what you are doing. Don’t gloss over the market size or competition! Hope this helps you find a good pitch deck template for your fundraise! Contact Us for a Free Consultation Get the information you need Get in Touch Also read: Venture Capital Angel Investors Seed Funds How Do Venture Capitalists Make Decisions? Angel Investors Seed Funds Seven Reasons Early 2023 is a Good Time to Raise a Seed Round Angel Investors Venture Capital Do Investors Pay Capital Gains on Converted SAFE Notes? Venture Capital Seed Funds Angel Investors What is the right amount of venture capital to raise? Talk to a leading startup CPA",
        "id": "b8e01d70-629e-4bb9-95cf-a2a0c9b139ca",
        "title": "Top 10 VC Pitch Decks, Examples and Templates 4",
        "url": "https://kruzeconsulting.com/blog/top-5-venture-capital-pitch-decks/"
      }
    },
    {
      "id": "d94f102b-3124-4c59-aa0d-2ca6290b5dd5",
      "score": 0.872978449,
      "values": [],
      "metadata": {
        "content": "founders overlook the importance of including a competition slide in their presentation. This is a major mistake, as not acknowledging competition can lead investors to think the founders are unaware of their market landscape. It’s one of my favorite slides. If you’ve got big competitors, great, you’ve just helped the VC understand who you might sell the company to in a few years! That’s just a few of the top venture capital pitch deck fails we go over in the video - check it out. Being aware of these common mistakes and addressing them in your pitch deck can significantly enhance your chances of capturing a venture capitalist’s interest. Common VC Pitch Deck Fails Video Tips for the financial section of your pitch deck As financial advisors to funded startups, we tend to overly index on the financial section of our client’s fundraising pitch decks. Note that this is our interest area (and how we get paid), so it may or may not be all that interesting or important for your startup’s presentation. The financial detail that you go into in your VC deck will vary based on the stage of your business. So, let’s breakdown what you might need for a seed to Series C company. Seed stage - Your pitch deck only needs a brief description of what you are intending to do with the money. As Scott mentioned above, a visual can go a long way here. Since revenue is now often expected for an A, you should articulate some sort of an expectation in revenue before the money runs out (i.e. investors want to know if you’ll have the exit velocity you need to raise the next round). Series A - A 5-year view is ideal, as this gives you the chance to show / “prove” that you are going to create a venture scale business. An extrapolated income statement with include revenue growth, high-level spend, burn, and other KPIs like customer count. You ought to have an appendix with more detail - or just a piece of excel that you can share (probably better at this stage). Series B - You are still going to need the 5-year projections. But, at a B, you’ll have more financially minded investors. This means that you ought to have a real appendix section that gets into the drives and assumptions to your continued growth. SaaS companies are going to need to be able to explain how they calculate their LTV to CAC - so your pitch deck will have to address both parts of that calculation. You can still put the detail in the appendix, but have it organized so that you can go through all the financial part in an organized presentation if needed. Series C - Series C companies should have real financials that have been prepared by a professional accountant, either in house or as a consultant. While you’ll still want a single slide in the meat of the pitch deck that has your five year vision, your historical results will also matter - so that slide will have to do a lot. This may mean that you have to push your KPIs like customer count into a seperate slide(s). And the financial appendix should have historical statement - probably all three - and projections. Finally, we’ve complied some other pitch deck examples that you may find helpful. Again, we think the best VC pitch decks templates/examples are the ones we highlighted at the top of this page, but here are some of the others that are floating around on the internet that you may like. Five More of the Best Pitch Deck Examples Uber (pitch deck here) - this is when they were still called “UberCab.” And it’s very early in the life of the company, so is product and market focused. You won’t find data about the company’s performance, since it’s so early. This deck may be helpful to pre-launched startups. Intercom (seed pitch deck here) - another example of a seed stage pitch deck, this one for when Intercom was raising $600k. This is a short deck - only 8 slides - and it focuses on the team, problem, solution and market. Note that the “progress” slide consists of a tweet from a user - pretty slight - you may not be able to get away with this lightweight of a presentation unless you have the clout of these founders. BUT if you are looking to talk about the market size and opportunity, this is a decent example. Mattermark (deck here) - data company Mattermark has real traction, and there are several examples of solid metrics/charting visuals in this deck. With $1.5M in ARR at the time of this pitch, they are probably around where many Series A’s are getting done in Silicon Valley. (I’ve even seen Series B’s happening at this level). This is a great pitch deck example if you are looking to impress the VCs’ with your traction. Check out slides 11, 12 and 13 for information on how to present historical revenue growth, projections and customer industry diversification. Mixpanel (deck on slideshare here) - Mixpanel shared their deck as an example that other startup can use. This is the set of slides that Mixpanel used to raise a $65M round. The competition slide is particularly good for driving a disucssion with the VCs. The traction slide is also strong - one of the best in combining the visual “up and to the right” chart with some details on the company’s milestones. The slide that is close to the “what we do with your money / operating slide” is a good overview of what the company needs to do to grow, although it’s not as focused on financials as I’d like. Mint (seed pitch deck here) - A great seed stage fundraising deck, with the whole enchilada: a good team slide, a great market size one, solid competition, user acquisition, and a financial slide that makes my inner accountant happy. Notice the flow on this slide, with the team slide right near the front. This could be the best template/example for companies with an experienced team. So that makes 10 of the best pitch deck templates and examples that we’ve seen on the internet. Pitch Deck Example from a Kruze Client One of our clients, DeepScribe, was interviewed on TechCrunch Live about their Series A fundraising process. Akilesh Bapu, the CEO and co-Founder of DeepScribe, was interviewed along with Nina Achadjian, a VC and Partner at Index Ventures. Nina invested $30 million into the company, and was impressed with the founders and the story they explained during their pitch. In addition to giving Kruze Consulting a shout-out for our help on his accounting diligence (thanks Akilesh!) he also walks through part of his VC pitch deck. It’s one of the better examples that we’ve seen of a live pitch deck presentation. You can watch on Youtube or see below. What Questions do VCs ask During a Pitch? Questions during a pitch are a GREAT sign - that means that the venture capitalist is paying attention. I strongly recommend founders use their venture capital pitch deck as a crutch, jumping to the right slide to answer the specific question , then going back to the original presentation order to make sure all important topics are hit. Again, I’ve seen partners reject a company because “the founder didn’t talk about go to market.” Yeah, they didn’t have time to talk about it because of all of your questions! Here are some of the trickier questions investors might ask during a presentation. Think about which slide you might be able to use to answer these questions. Resist the temptation to argue with a VC if they ask difficult questions; saying you don’t know but then laying out your plan to figure it out is a great response to many questions. Questions VCs Ask What’s the backstory? Tell me about yourself How did you meet",
        "id": "d94f102b-3124-4c59-aa0d-2ca6290b5dd5",
        "title": "Top 10 VC Pitch Decks, Examples and Templates 3",
        "url": "https://kruzeconsulting.com/blog/top-5-venture-capital-pitch-decks/"
      }
    },
    {
      "id": "a2f192e0-082b-4aab-8d43-de0dfa9d1aac",
      "score": 0.870949,
      "values": [],
      "metadata": {
        "content": "probably OK ignoring my advice and just getting straight from the cover page to the problem statement. Tips for your slides Here are some of the slides that we mention above and some tips that founders we work with have found helpful: Problem Slide - Invite the investor into discussing / discovering the problem with you. Some problems are obvious - but that doesn’t mean that the VC has thought about them deeply before. Help the investor understand the issues from the eyes of the buyer/consumer. The best venture capital pitch decks have problem slides that are strong enough to make the investor really, really want to meet with you. Go to Market / Growth Slide - For companies that are already generating revenue and growing, show that you know who your customers are and where you can find them. For pre-revenue startups, use this slide to prove that the founders have 1) thought about how to sell the product and 2) have a plan on what you will try to prove vis a vis your sales and marketing with the capital you are raising. Seed Pitch Deck Outline Our COO, Scott Orn (also a former VC) has been assisting a number of seed and pre-seed companies during their fundraises, and has produced an outline/template for a seed pitch deck. Pre-seed is sort of a new asset class. It’s essentially the first money in. That’s what seed used to be for everyone. So this is applicable to pre-seed and seed - basically, what to present when your company is more of an idea. Company’s slogan / 1 sentence elevator pitch - the first page or first slide should really just be the company’s name and slogan, or the one sentence, what you are doing. And just get the audience focused on that. Make sure to make an impression, deliver it with passion. You are in sell mode here. You’re pitching investors. Problem - what are your customers struggling with? A lot of investors like the problem-solution type of framework, so the next slide would be the problem. So talk about how your potential customers are suffering, what’s going on right now in the market, why it’s not working, and then the next page in the deck will be your solution. Solution - how are you going to make everyone’s life better? You can explain how you’re going to be better, how you’ll save your clients or customers a ton of time, a ton of money, etc. Better, faster, cheaper is a Silicon Valley slogan that people typically use when explaining their startup’s solution. The Product / Service Nothing is more powerful than a demo. That also shows that the company has actually built something and you can get a taste for it. Often you see a screenshot of the demo and often can click for video. Some people like more visual depictions of what you are doing. Regardless, in this section, something visual is pretty helpful. You want to get the conversation going, you want them to react to something, you want them to feel vested in what you’re doing. Get them to buy into the solution. Market Size This is kind of a “check the box” because it’s always hard to size the market. And many of the best companies look like they have a tiny market but turn it into something huge. But it’s a good exercise and tells investors where you are going. And, remember, venture capital is really just wanting to invest in big opportunities. VCs are okay with some losses, but when something works, they need it to be big. And so that’s why they really care about market size. This section helps prove to the seed investor that you are pointed at a big possible market, and that you are aiming to make a big company vs. a nice, small, lifestyle business. You would be surprised at how many small businesses, that never really anticipate getting bigger than a couple of million in revenue, try to raise seed financing. So the seed investors need to be able to weed out the entrepreneurs who are not focusing on big opportunities, and you do that in this part of your seed pitch deck. And if you’re willing to spend a bunch of your time, five, 10 years of your career on something, there better be some size to it! Competition You want to identify competitors. If you pretend you don’t have competitors or bad mouth them, you’ll lose credibility. investors typically like you to acknowledge your competition. And oftentimes there’s a little bit of education, because you know this market really well, but the seed investor doesn’t, so here is where you teach them about the competition. Seed investors know that competitors aren’t the end of the world. In fact, the best venture capitalists actually LIKE successful competitors, because it helps validate that there is a market for the solution. Go to Market Plan This is a super important slide. Are you using a sales team? Partnerships? Online marketing? Events? Creativity, different approaches and things that investors have seen work are great. Financials How much money do you need? How long will that get you? When do you think you’ll start to generate revenue. A visual is really good as part of this slide. It’s important to understand the seed investors mindset on this slide. They are doing the math, and they’re thinking, what does this company need to raise money from a series A venture capitalist? Because really, at every step of the venture capital game, people are putting money into your company and then hoping other people will step up down the road to fund the company. The seed investors that you are pitching only have so much capital. They are going to rely on your company doing well enough, and looking strong enough, to be able to get a VC to invest in your next round. And so, they’re doing that math and trying to figure out what is going to be that milestone that really brings other venture investors in the company? Exit Opportunities Some seed investors don’t want you to talk about a sale eventually. They are essentially saying “I don’t want to even hear that you’re thinking about selling the company in three years or four years, or how could you possibly know who’s gonna buy it?” Which is very fair. So you needed to kind of tread lightly on this. I think the way I typically like to do this is just point out the players in the market and make the point that if you get traction and you’re successful, these people or these companies are gonna have a real strong vested interest in acquiring you. And so that’s kind of enough. It’s enough to say that if we hit traction, there will be a lot of interested companies like X, Y Z. You don’t need to say like “I’m going to get bought for X number of dollars in year three” or something like that. Just talking about who could buy you or who would be interested is a delicate way of doing this. It’s always great when a founder says, “I’m taking this through IPO. I’m committed.” Note from Healy: While Scott may really like this slide, I don’t love it as much, because, as Scott mentions, it makes me afraid that the CEO is not in it for the long term. I usually prefer to discuss this on the competition slide, “here are other, very big companies, that don’t play in this solution but who have the same customer base as we want… they may get into our market. Who knows, they may acquire their way in once they realise the solution is being adopted.” I like that method better, as it doesn’t imply to the seed investors or the VCs that you are putting the cart before the horse, instead it says that you know who the heavy hitters are in the general market, and then the investor can do the mental math to think that",
        "id": "a2f192e0-082b-4aab-8d43-de0dfa9d1aac",
        "title": "Top 10 VC Pitch Decks, Examples and Templates 1",
        "url": "https://kruzeconsulting.com/blog/top-5-venture-capital-pitch-decks/"
      }
    }
  ],
  "firstMatchContent": "your cofounder? Tell me about the team? How did you find your first hires? What is the specific problem you are solving? What’s the key insight about your user that led you to build this business? What’s the ideal outcome for your customer? How are customers currently solving this problem, before your product/solution existed? What differentiates your solution from alternatives? What have your biggest learnings been so far? How are you planning to acquire customers? What would your customers say about your solution, and how would they react if it went away (i.e. you went out of business)? Why now? What has changed in technology or the market that makes this possible only now? What do you think has to go right for this to be a massive outcome? How much do you want to raise, and what milestones do you hit with that capital? VC Pitch Deck FAQ Because Google says people are asking questions. What is a VC pitch deck? A VC pitch deck is a presentation (typically in Powerpoint, Google Sheets or PDF) used to explain a startup idea to potential venture capital investors. A pitch deck contains information on the business, the market and the company’s traction/financials. What is a pitch deck used for? These presentations are used to 1) convince venture capitalists to take a 1st meeting with the founder(s); 2) begin investment due diligence and 3) convince the venture firm’s partnership to want to invest in a startup. Will a deck help you get a meeting with a VC? A great venture capital pitch deck may help you get a meeting with a venture capitalist. VC firm NFX reminds startup founders that investors are looking for the following 12 data points before taking a meeting with a startup: Team Company description Market opportunity Business model (how you make $ + your financial projections) Geography (less important post COVID) Team size (FTEs) Timing of the fundraise Company traction How much you are raising Fundraising history Fit for the specific VC Referrer - who introduced you to the fund Does your venture capital presentation have to be PowerPoint? VCs typically expect a slide deck; these days usually a PowerPoint, Google Slides or a PDF of one of those formats. I’ve been with companies that have used designers to create an incredibly slick venture capital presentation, which they presented as a PDF - no idea which tool was used to actually design the presentation, but it was likely an Adobe product. The most important thing is making the presentation be in 1) slides and 2) something they can share and access from their computer. Is it OK to share your venture capital presentation by DocSend or a presentation sharing platform instead of as an email attachment? These days more and more VCs are Ok getting the presentation as a DocSend or other presentation sharing platform that asks for their email address or asks to verify that they are someone you to share the document with. However, you’ll occasionally find the grump VC who wants their presentation the old school way. Often these investors write up their dislike of sharing tools on their blog or Twitter. How do you modify your pitch deck for the final, all-hands VC partner pitch? The final step to getting a term sheet, at many venture capital firms, is to pitch the partnership one final time. This is after you’ve already gotten one of the partners to support your investment internally as the champion. In the final meeting, you’ll have the full range of understanding of your company - from the partner who is supporting you and who knows a ton to partners who know close to nothing. It’s not safe to assume knowledge on your industry or problem. Invite all the partners into the fold by explaining and building excitement around what you are doing. Don’t gloss over the market size or competition! Hope this helps you find a good pitch deck template for your fundraise! Contact Us for a Free Consultation Get the information you need Get in Touch Also read: Venture Capital Angel Investors Seed Funds How Do Venture Capitalists Make Decisions? Angel Investors Seed Funds Seven Reasons Early 2023 is a Good Time to Raise a Seed Round Angel Investors Venture Capital Do Investors Pay Capital Gains on Converted SAFE Notes? Venture Capital Seed Funds Angel Investors What is the right amount of venture capital to raise? Talk to a leading startup CPA",
  "data": {
    "results": [],
    "matches": [
      {
        "id": "b8e01d70-629e-4bb9-95cf-a2a0c9b139ca",
        "score": 0.88221848,
        "values": [],
        "metadata": {
          "content": "your cofounder? Tell me about the team? How did you find your first hires? What is the specific problem you are solving? What’s the key insight about your user that led you to build this business? What’s the ideal outcome for your customer? How are customers currently solving this problem, before your product/solution existed? What differentiates your solution from alternatives? What have your biggest learnings been so far? How are you planning to acquire customers? What would your customers say about your solution, and how would they react if it went away (i.e. you went out of business)? Why now? What has changed in technology or the market that makes this possible only now? What do you think has to go right for this to be a massive outcome? How much do you want to raise, and what milestones do you hit with that capital? VC Pitch Deck FAQ Because Google says people are asking questions. What is a VC pitch deck? A VC pitch deck is a presentation (typically in Powerpoint, Google Sheets or PDF) used to explain a startup idea to potential venture capital investors. A pitch deck contains information on the business, the market and the company’s traction/financials. What is a pitch deck used for? These presentations are used to 1) convince venture capitalists to take a 1st meeting with the founder(s); 2) begin investment due diligence and 3) convince the venture firm’s partnership to want to invest in a startup. Will a deck help you get a meeting with a VC? A great venture capital pitch deck may help you get a meeting with a venture capitalist. VC firm NFX reminds startup founders that investors are looking for the following 12 data points before taking a meeting with a startup: Team Company description Market opportunity Business model (how you make $ + your financial projections) Geography (less important post COVID) Team size (FTEs) Timing of the fundraise Company traction How much you are raising Fundraising history Fit for the specific VC Referrer - who introduced you to the fund Does your venture capital presentation have to be PowerPoint? VCs typically expect a slide deck; these days usually a PowerPoint, Google Slides or a PDF of one of those formats. I’ve been with companies that have used designers to create an incredibly slick venture capital presentation, which they presented as a PDF - no idea which tool was used to actually design the presentation, but it was likely an Adobe product. The most important thing is making the presentation be in 1) slides and 2) something they can share and access from their computer. Is it OK to share your venture capital presentation by DocSend or a presentation sharing platform instead of as an email attachment? These days more and more VCs are Ok getting the presentation as a DocSend or other presentation sharing platform that asks for their email address or asks to verify that they are someone you to share the document with. However, you’ll occasionally find the grump VC who wants their presentation the old school way. Often these investors write up their dislike of sharing tools on their blog or Twitter. How do you modify your pitch deck for the final, all-hands VC partner pitch? The final step to getting a term sheet, at many venture capital firms, is to pitch the partnership one final time. This is after you’ve already gotten one of the partners to support your investment internally as the champion. In the final meeting, you’ll have the full range of understanding of your company - from the partner who is supporting you and who knows a ton to partners who know close to nothing. It’s not safe to assume knowledge on your industry or problem. Invite all the partners into the fold by explaining and building excitement around what you are doing. Don’t gloss over the market size or competition! Hope this helps you find a good pitch deck template for your fundraise! Contact Us for a Free Consultation Get the information you need Get in Touch Also read: Venture Capital Angel Investors Seed Funds How Do Venture Capitalists Make Decisions? Angel Investors Seed Funds Seven Reasons Early 2023 is a Good Time to Raise a Seed Round Angel Investors Venture Capital Do Investors Pay Capital Gains on Converted SAFE Notes? Venture Capital Seed Funds Angel Investors What is the right amount of venture capital to raise? Talk to a leading startup CPA",
          "id": "b8e01d70-629e-4bb9-95cf-a2a0c9b139ca",
          "title": "Top 10 VC Pitch Decks, Examples and Templates 4",
          "url": "https://kruzeconsulting.com/blog/top-5-venture-capital-pitch-decks/"
        }
      },
      {
        "id": "d94f102b-3124-4c59-aa0d-2ca6290b5dd5",
        "score": 0.872978449,
        "values": [],
        "metadata": {
          "content": "founders overlook the importance of including a competition slide in their presentation. This is a major mistake, as not acknowledging competition can lead investors to think the founders are unaware of their market landscape. It’s one of my favorite slides. If you’ve got big competitors, great, you’ve just helped the VC understand who you might sell the company to in a few years! That’s just a few of the top venture capital pitch deck fails we go over in the video - check it out. Being aware of these common mistakes and addressing them in your pitch deck can significantly enhance your chances of capturing a venture capitalist’s interest. Common VC Pitch Deck Fails Video Tips for the financial section of your pitch deck As financial advisors to funded startups, we tend to overly index on the financial section of our client’s fundraising pitch decks. Note that this is our interest area (and how we get paid), so it may or may not be all that interesting or important for your startup’s presentation. The financial detail that you go into in your VC deck will vary based on the stage of your business. So, let’s breakdown what you might need for a seed to Series C company. Seed stage - Your pitch deck only needs a brief description of what you are intending to do with the money. As Scott mentioned above, a visual can go a long way here. Since revenue is now often expected for an A, you should articulate some sort of an expectation in revenue before the money runs out (i.e. investors want to know if you’ll have the exit velocity you need to raise the next round). Series A - A 5-year view is ideal, as this gives you the chance to show / “prove” that you are going to create a venture scale business. An extrapolated income statement with include revenue growth, high-level spend, burn, and other KPIs like customer count. You ought to have an appendix with more detail - or just a piece of excel that you can share (probably better at this stage). Series B - You are still going to need the 5-year projections. But, at a B, you’ll have more financially minded investors. This means that you ought to have a real appendix section that gets into the drives and assumptions to your continued growth. SaaS companies are going to need to be able to explain how they calculate their LTV to CAC - so your pitch deck will have to address both parts of that calculation. You can still put the detail in the appendix, but have it organized so that you can go through all the financial part in an organized presentation if needed. Series C - Series C companies should have real financials that have been prepared by a professional accountant, either in house or as a consultant. While you’ll still want a single slide in the meat of the pitch deck that has your five year vision, your historical results will also matter - so that slide will have to do a lot. This may mean that you have to push your KPIs like customer count into a seperate slide(s). And the financial appendix should have historical statement - probably all three - and projections. Finally, we’ve complied some other pitch deck examples that you may find helpful. Again, we think the best VC pitch decks templates/examples are the ones we highlighted at the top of this page, but here are some of the others that are floating around on the internet that you may like. Five More of the Best Pitch Deck Examples Uber (pitch deck here) - this is when they were still called “UberCab.” And it’s very early in the life of the company, so is product and market focused. You won’t find data about the company’s performance, since it’s so early. This deck may be helpful to pre-launched startups. Intercom (seed pitch deck here) - another example of a seed stage pitch deck, this one for when Intercom was raising $600k. This is a short deck - only 8 slides - and it focuses on the team, problem, solution and market. Note that the “progress” slide consists of a tweet from a user - pretty slight - you may not be able to get away with this lightweight of a presentation unless you have the clout of these founders. BUT if you are looking to talk about the market size and opportunity, this is a decent example. Mattermark (deck here) - data company Mattermark has real traction, and there are several examples of solid metrics/charting visuals in this deck. With $1.5M in ARR at the time of this pitch, they are probably around where many Series A’s are getting done in Silicon Valley. (I’ve even seen Series B’s happening at this level). This is a great pitch deck example if you are looking to impress the VCs’ with your traction. Check out slides 11, 12 and 13 for information on how to present historical revenue growth, projections and customer industry diversification. Mixpanel (deck on slideshare here) - Mixpanel shared their deck as an example that other startup can use. This is the set of slides that Mixpanel used to raise a $65M round. The competition slide is particularly good for driving a disucssion with the VCs. The traction slide is also strong - one of the best in combining the visual “up and to the right” chart with some details on the company’s milestones. The slide that is close to the “what we do with your money / operating slide” is a good overview of what the company needs to do to grow, although it’s not as focused on financials as I’d like. Mint (seed pitch deck here) - A great seed stage fundraising deck, with the whole enchilada: a good team slide, a great market size one, solid competition, user acquisition, and a financial slide that makes my inner accountant happy. Notice the flow on this slide, with the team slide right near the front. This could be the best template/example for companies with an experienced team. So that makes 10 of the best pitch deck templates and examples that we’ve seen on the internet. Pitch Deck Example from a Kruze Client One of our clients, DeepScribe, was interviewed on TechCrunch Live about their Series A fundraising process. Akilesh Bapu, the CEO and co-Founder of DeepScribe, was interviewed along with Nina Achadjian, a VC and Partner at Index Ventures. Nina invested $30 million into the company, and was impressed with the founders and the story they explained during their pitch. In addition to giving Kruze Consulting a shout-out for our help on his accounting diligence (thanks Akilesh!) he also walks through part of his VC pitch deck. It’s one of the better examples that we’ve seen of a live pitch deck presentation. You can watch on Youtube or see below. What Questions do VCs ask During a Pitch? Questions during a pitch are a GREAT sign - that means that the venture capitalist is paying attention. I strongly recommend founders use their venture capital pitch deck as a crutch, jumping to the right slide to answer the specific question , then going back to the original presentation order to make sure all important topics are hit. Again, I’ve seen partners reject a company because “the founder didn’t talk about go to market.” Yeah, they didn’t have time to talk about it because of all of your questions! Here are some of the trickier questions investors might ask during a presentation. Think about which slide you might be able to use to answer these questions. Resist the temptation to argue with a VC if they ask difficult questions; saying you don’t know but then laying out your plan to figure it out is a great response to many questions. Questions VCs Ask What’s the backstory? Tell me about yourself How did you meet",
          "id": "d94f102b-3124-4c59-aa0d-2ca6290b5dd5",
          "title": "Top 10 VC Pitch Decks, Examples and Templates 3",
          "url": "https://kruzeconsulting.com/blog/top-5-venture-capital-pitch-decks/"
        }
      },
      {
        "id": "a2f192e0-082b-4aab-8d43-de0dfa9d1aac",
        "score": 0.870949,
        "values": [],
        "metadata": {
          "content": "probably OK ignoring my advice and just getting straight from the cover page to the problem statement. Tips for your slides Here are some of the slides that we mention above and some tips that founders we work with have found helpful: Problem Slide - Invite the investor into discussing / discovering the problem with you. Some problems are obvious - but that doesn’t mean that the VC has thought about them deeply before. Help the investor understand the issues from the eyes of the buyer/consumer. The best venture capital pitch decks have problem slides that are strong enough to make the investor really, really want to meet with you. Go to Market / Growth Slide - For companies that are already generating revenue and growing, show that you know who your customers are and where you can find them. For pre-revenue startups, use this slide to prove that the founders have 1) thought about how to sell the product and 2) have a plan on what you will try to prove vis a vis your sales and marketing with the capital you are raising. Seed Pitch Deck Outline Our COO, Scott Orn (also a former VC) has been assisting a number of seed and pre-seed companies during their fundraises, and has produced an outline/template for a seed pitch deck. Pre-seed is sort of a new asset class. It’s essentially the first money in. That’s what seed used to be for everyone. So this is applicable to pre-seed and seed - basically, what to present when your company is more of an idea. Company’s slogan / 1 sentence elevator pitch - the first page or first slide should really just be the company’s name and slogan, or the one sentence, what you are doing. And just get the audience focused on that. Make sure to make an impression, deliver it with passion. You are in sell mode here. You’re pitching investors. Problem - what are your customers struggling with? A lot of investors like the problem-solution type of framework, so the next slide would be the problem. So talk about how your potential customers are suffering, what’s going on right now in the market, why it’s not working, and then the next page in the deck will be your solution. Solution - how are you going to make everyone’s life better? You can explain how you’re going to be better, how you’ll save your clients or customers a ton of time, a ton of money, etc. Better, faster, cheaper is a Silicon Valley slogan that people typically use when explaining their startup’s solution. The Product / Service Nothing is more powerful than a demo. That also shows that the company has actually built something and you can get a taste for it. Often you see a screenshot of the demo and often can click for video. Some people like more visual depictions of what you are doing. Regardless, in this section, something visual is pretty helpful. You want to get the conversation going, you want them to react to something, you want them to feel vested in what you’re doing. Get them to buy into the solution. Market Size This is kind of a “check the box” because it’s always hard to size the market. And many of the best companies look like they have a tiny market but turn it into something huge. But it’s a good exercise and tells investors where you are going. And, remember, venture capital is really just wanting to invest in big opportunities. VCs are okay with some losses, but when something works, they need it to be big. And so that’s why they really care about market size. This section helps prove to the seed investor that you are pointed at a big possible market, and that you are aiming to make a big company vs. a nice, small, lifestyle business. You would be surprised at how many small businesses, that never really anticipate getting bigger than a couple of million in revenue, try to raise seed financing. So the seed investors need to be able to weed out the entrepreneurs who are not focusing on big opportunities, and you do that in this part of your seed pitch deck. And if you’re willing to spend a bunch of your time, five, 10 years of your career on something, there better be some size to it! Competition You want to identify competitors. If you pretend you don’t have competitors or bad mouth them, you’ll lose credibility. investors typically like you to acknowledge your competition. And oftentimes there’s a little bit of education, because you know this market really well, but the seed investor doesn’t, so here is where you teach them about the competition. Seed investors know that competitors aren’t the end of the world. In fact, the best venture capitalists actually LIKE successful competitors, because it helps validate that there is a market for the solution. Go to Market Plan This is a super important slide. Are you using a sales team? Partnerships? Online marketing? Events? Creativity, different approaches and things that investors have seen work are great. Financials How much money do you need? How long will that get you? When do you think you’ll start to generate revenue. A visual is really good as part of this slide. It’s important to understand the seed investors mindset on this slide. They are doing the math, and they’re thinking, what does this company need to raise money from a series A venture capitalist? Because really, at every step of the venture capital game, people are putting money into your company and then hoping other people will step up down the road to fund the company. The seed investors that you are pitching only have so much capital. They are going to rely on your company doing well enough, and looking strong enough, to be able to get a VC to invest in your next round. And so, they’re doing that math and trying to figure out what is going to be that milestone that really brings other venture investors in the company? Exit Opportunities Some seed investors don’t want you to talk about a sale eventually. They are essentially saying “I don’t want to even hear that you’re thinking about selling the company in three years or four years, or how could you possibly know who’s gonna buy it?” Which is very fair. So you needed to kind of tread lightly on this. I think the way I typically like to do this is just point out the players in the market and make the point that if you get traction and you’re successful, these people or these companies are gonna have a real strong vested interest in acquiring you. And so that’s kind of enough. It’s enough to say that if we hit traction, there will be a lot of interested companies like X, Y Z. You don’t need to say like “I’m going to get bought for X number of dollars in year three” or something like that. Just talking about who could buy you or who would be interested is a delicate way of doing this. It’s always great when a founder says, “I’m taking this through IPO. I’m committed.” Note from Healy: While Scott may really like this slide, I don’t love it as much, because, as Scott mentions, it makes me afraid that the CEO is not in it for the long term. I usually prefer to discuss this on the competition slide, “here are other, very big companies, that don’t play in this solution but who have the same customer base as we want… they may get into our market. Who knows, they may acquire their way in once they realise the solution is being adopted.” I like that method better, as it doesn’t imply to the seed investors or the VCs that you are putting the cart before the horse, instead it says that you know who the heavy hitters are in the general market, and then the investor can do the mental math to think that",
          "id": "a2f192e0-082b-4aab-8d43-de0dfa9d1aac",
          "title": "Top 10 VC Pitch Decks, Examples and Templates 1",
          "url": "https://kruzeconsulting.com/blog/top-5-venture-capital-pitch-decks/"
        }
      }
    ],
    "namespace": ""
  }
}
